#include "global.h"
#include "main.h"
#include "battle.h"
#include "battle_interface.h"
#include "battle_anim.h"
#include "frontier_util.h"
#include "battle_message.h"
#include "battle_tent.h"
#include "battle_factory.h"
#include "bg.h"
#include "contest.h"
#include "contest_effect.h"
#include "data.h"
#include "daycare.h"
#include "decompress.h"
#include "dynamic_placeholder_text_util.h"
#include "event_data.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "international_string_util.h"
#include "item.h"
#include "link.h"
#include "m4a.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "mon_markings.h"
#include "party_menu.h"
#include "palette.h"
#include "pokeball.h"
#include "pokemon.h"
#include "pokemon_icon.h"
#include "pokemon_storage_system.h"
#include "pokemon_summary_screen.h"
#include "region_map.h"
#include "scanline_effect.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "text.h"
#include "tv.h"
#include "window.h"
#include "constants/items.h"
#include "constants/moves.h"
#include "constants/party_menu.h"
#include "constants/region_map_sections.h"
#include "constants/rgb.h"
#include "constants/songs.h"
#include "constants/species.h"

// Screen titles (upper left)
#define PSS_LABEL_WINDOW_POKEMON_INFO_TITLE 1
#define PSS_LABEL_WINDOW_POKEMON_SKILLS_TITLE 2
#define PSS_LABEL_WINDOW_BATTLE_MOVES_TITLE 3
#define PSS_LABEL_WINDOW_IV_EV_TITLE 4

// Button control text (upper right)
#define PSS_LABEL_WINDOW_PROMPT_CANCEL 5
#define PSS_LABEL_WINDOW_PROMPT_INFO 6
#define PSS_LABEL_WINDOW_PROMPT_SWITCH 7

// Above the pokemon's portrait
#define PSS_LABEL_WINDOW_PORTRAIT_LVL 9
#define PSS_LABEL_WINDOW_PORTRAIT_NICKNAME 10
#define PSS_LABEL_WINDOW_END 11

// Dynamic fields for the Pokemon Info page
#define PSS_DATA_WINDOW_INFO 0
#define PSS_DATA_WINDOW_INFO_TRAINER_MEMO 1

// Dynamic fields for the Pokemon Skills page
#define PSS_DATA_WINDOW_SKILLS_HP 0
#define PSS_DATA_WINDOW_SKILLS_STATS 1
#define PSS_DATA_WINDOW_SKILLS_EXP 2
#define PSS_DATA_WINDOW_SKILLS_ABILITY 3
#define PSS_DATA_WINDOW_SKILLS_DESCRIPTION 4 // Ability description

// Dynamic fields for the Battle Moves and Contest Moves pages.
#define PSS_DATA_WINDOW_MOVE_NAMES 0
#define PSS_DATA_WINDOW_MOVE_DESCRIPTION 1

// Dynamic fields for the Iv/Ev page
#define PSS_EV_WINDOW_STATS 0
#define PSS_IV_WINDOW_STATS 1

#define MOVE_SELECTOR_SPRITES_COUNT 2
// for the spriteIds field in PokemonSummaryScreenData
enum
{
    SPRITE_ARR_ID_MON,
    SPRITE_ARR_ID_BALL,
    SPRITE_ARR_ID_STATUS,
    SPRITE_ARR_ID_HP_BAR1,
    SPRITE_ARR_ID_HP_BAR2,
    SPRITE_ARR_ID_MON_ICON,
    SPRITE_ARR_ID_TYPE_MON1,
    SPRITE_ARR_ID_TYPE_MON2,
    SPRITE_ARR_ID_SPLIT,
    SPRITE_ARR_ID_NATURE_PLUS,
    SPRITE_ARR_ID_NATURE_MINUS,
    SPRITE_ARR_ID_TYPE_MOVE,
    SPRITE_ARR_ID_MOVE_SELECTOR1 = SPRITE_ARR_ID_TYPE_MOVE + 5, // 10 sprites that make up the selector
    SPRITE_ARR_ID_MOVE_SELECTOR2 = SPRITE_ARR_ID_MOVE_SELECTOR1 + MOVE_SELECTOR_SPRITES_COUNT,
    SPRITE_ARR_ID_COUNT = SPRITE_ARR_ID_MOVE_SELECTOR2 + MOVE_SELECTOR_SPRITES_COUNT
};

// for the icon sprite ids
enum
{
    SUMMARY_ICON_HP,
    SUMMARY_ICON_ATTACK,
    SUMMARY_ICON_DEFENSE,
    SUMMARY_ICON_SPATK,
    SUMMARY_ICON_SPDEF,
    SUMMARY_ICON_SPEED,
    SUMMARY_ICON_ABILITY,
    SUMMARY_ICON_EXP,
    SUMMARY_ICON_TRAINER_MEMO,
    SUMMARY_ICON_ID_NO,
    SUMMARY_ICON_ITEM,
    SUMMARY_ICON_NATURE,
    SUMMARY_ICON_NO,
    SUMMARY_ICON_NAME,
    SUMMARY_ICON_TYPE,
    SUMMARY_ICON_OT,
    SUMMARY_ICON_TOTAL_EVS,
    SUMMARY_ICON_IVS,
    SUMMARY_ICON_POWER,
    SUMMARY_ICON_ACCURACY,
    SUMMARY_ICON_EFFECT,
    SUMMARY_ICON_APPEAL,
    SUMMARY_ICON_JAM,
    SUMMARY_ICON_COUNT,
};

static EWRAM_DATA struct PokemonSummaryScreenData
{
    /*0x00*/ union {
        struct Pokemon *mons;
        struct BoxPokemon *boxMons;
    } monList;
    /*0x04*/ MainCallback callback;
    /*0x0C*/ struct Pokemon currentMon;
    /*0x70*/ struct PokeSummary
    {
        u16 species; // 0x0
        u16 species2; // 0x2
        u8 isEgg; // 0x4
        u8 level; // 0x5
        u8 ribbonCount; // 0x6
        u8 ailment; // 0x7
        u8 abilityNum; // 0x8
        u8 metLocation; // 0x9
        u8 metLevel; // 0xA
        u8 metGame; // 0xB
        u32 pid; // 0xC
        u32 exp; // 0x10
        u16 moves[MAX_MON_MOVES]; // 0x14
        u8 pp[MAX_MON_MOVES]; // 0x1C
        u16 currentHP; // 0x20
        u16 maxHP; // 0x22
        u16 stats[NUM_STATS - 1];
        u16 item; // 0x2E
        u16 friendship; // 0x30
        u8 OTGender; // 0x32
        u8 nature; // 0x33
        u8 ppBonuses; // 0x34
        u8 sanity; // 0x35
        u8 OTName[17]; // 0x36
        u8 nickname[POKEMON_NAME_LENGTH + 1];
        u8 evs[NUM_STATS + 1];
        u8 ivs[NUM_STATS];
        u32 OTID; // 0x48
    } summary;
    u16 bgTilemapBuffers[PSS_PAGE_COUNT][2][0x400];
    u8 mode;
    bool8 isBoxMon;
    u8 curMonIndex;
    u8 maxMonIndex;
    u8 currPageIndex;
    u8 minPageIndex;
    u8 maxPageIndex;
    bool8 lockMonFlag; // This is used to prevent the player from changing pokemon in the move deleter select, etc, but it is not needed because the input is handled differently there
    u16 newMove;
    u8 firstMoveIndex;
    u8 secondMoveIndex;
    bool8 lockMovesFlag; // This is used to prevent the player from changing position of moves in a battle or when trading.
    u8 bgDisplayOrder; // Determines the order page backgrounds are loaded while scrolling between them
    u8 windowIds[8];
    u8 laserSpriteIds[5];
    u8 spriteIds[SPRITE_ARR_ID_COUNT];
    u8 iconSpriteIds[SUMMARY_ICON_COUNT][2][2]; // Two sets allowing you to create 2 of every icon.
    bool8 unk40EF;
